{"data":{"site":{"siteMetadata":{"title":"Christian Vuerings","author":"Christian Vuerings"}},"markdownRemark":{"id":"e450e948-a29b-5193-b58e-c7b9187300b1","excerpt":"Since the day we’ve had multiple computer languages, developers started arguing about which language is the best. It’s almost like debating which brand of car…","html":"<p>Since the day we’ve had multiple computer languages, developers started arguing about which language is the best. It’s almost like debating which brand of car is better.</p>\n<p>Is an Audi better than a BMW? Some will argue it is. In the end, people are still buying both brands.</p>\n<p>Currently, the last new shinny toys in developer land are JavaScript MV*s, like <a href=\"http://angularjs.org/\">AngularJS</a>, <a href=\"http://documentcloud.github.io/backbone/\">Backbone.js</a> or <a href=\"http://emberjs.com/\">Ember.js</a>. Each one has their own strengths and weaknesses.</p>\n<blockquote>\n<p>It’s not about 1 technology fits all, it’s about how that technology fits your needs.</p>\n</blockquote>\n<p>Last week we started out I had a conversation with one of our user experience designers, this is how it went:</p>\n<blockquote>\n<p>C: Could you highlight the user annoyances, they are blockers for us.<br>\nJ: Really? That is usually not what I hear from developers.</p>\n</blockquote>\n<p>This stuck with me.</p>\n<p>Somewhere along the way some developers lost touch with their user base. It’s good to remember why we’re here as developers. We’re here to create software that gives power to our users.</p>\n<p>Ultimately, it’s not about the technology you’re developing with; it’s about the experience users have when they are interacting with your programs.</p>","frontmatter":{"title":"It's Not About The Technology","date":"October 19, 2013"}}},"pageContext":{"slug":"/not-about-the-technology/","previous":{"fields":{"slug":"/fixing-security-preferences-in-os-x-mountain-lion/"},"frontmatter":{"title":"Fixing Security Preferences in OS X Mountain Lion"}},"next":{"fields":{"slug":"/berkeleydir/"},"frontmatter":{"title":"Berkeleydir"}}}}