{"data":{"site":{"siteMetadata":{"title":"Christian Vuerings","author":"Christian Vuerings"}},"markdownRemark":{"id":"c3266e09-b135-5b97-9a59-cb2cbc77892e","excerpt":"Lately Lately I’ve been hacking around with userscripts. Those scripts are JavaScript files that can enhance the experience of a user on certain websites. Here…","html":"<h3>Lately</h3>\n<p>Lately I’ve been hacking around with userscripts. Those scripts are JavaScript files that can enhance the experience of a user on certain websites. Here’s a list to get you to start thinking:</p>\n<p>Make a site more readable by changing the color of the text.\nAdd support for keyboard shortcuts.\nRemove really annoying ads.\nOf course you could think of many more things, the list is literately endless.</p>\n<h3>My scripts</h3>\n<h4><a href=\"https://userscripts.org/scripts/show/89761\">The Piratebay Ad Remover</a></h4>\n<p>My most popular script so far is an ad remover for <a href=\"https://thepiratebay.org/\">thepiratebay.org</a>. The first version of the script was launched on the 5th of November 2010 and has had 320 downloads so far.</p>\n<h4><a href=\"http://userscripts.org/scripts/show/93984\">Ted.com Alternative Video Player</a></h4>\n<p>When looking at talks on <a href=\"https://www.ted.com/\">ted.com</a>, the default flash player always annoyed me. The full screen button didn’t work and seeking through the video was buggy. Apart from that, when you go full screen, you still had the flash player controls on the top and bottom of the screen. As an alternative, I wanted to use the open-source <a href=\"https://www.jwplayer.com/\">JW Player</a>.</p>\n<h4><a href=\"http://userscripts.org/scripts/show/93041\">mflow Keyboard Shortcuts</a></h4>\n<p><a href=\"http://mflow.com/\">mflow.com</a> is a great online music player for discovering new songs. The script ads some basic keyboard shortcuts to pause/resume a song or go to the next one. It was pretty straightforward to do, since I was able to access their JavaScript library.</p>\n<h4>Other scripts</h4>\n<p>You can find some of the other scripts I wrote and a more up to date list on my <a href=\"http://userscripts.org/scripts/show/93984\">userscripts.org profile page</a>.</p>\n<h3>Things to remember</h3>\n<ul>\n<li>Don’t use jQuery when you can do it natively.\nBoth firefox and google chrome support JavaScript quite extensively. As you’ll read further on Chrome also doesn’t support the @require attribute.</li>\n<li>Write plenty of documentation in your code as well as on <a href=\"http://userscripts.org/\">userscripts.org</a>.</li>\n</ul>\n<h3>Google Chrome compatibility issues</h3>\n<p>If you want to make sure that your script also runs in Google Chrome, do the following:</p>\n<h4>@match attribute</h4>\n<p>Next to the @include attribute, also use the <a href=\"https://www.chromium.org/developers/design-documents/user-scripts#TOC-Match-Patterns\">@match attribute</a>. This will make sure that the user who install the userscript will get an appropriate message:</p>\n<h4>Don’t use the @require attribute.</h4>\n<p>Most of the time you don’t need this, but if you do, create a script element and append it to the head or body.</p>\n<h4>Don’t use the unsafeWindow variable.</h4>\n<p>Greasemonkey allows you to access global JavaScript variables through this variable, but google chrome doesn’t. You can find a workaround in my <a href=\"http://userscripts.org/scripts/review/93041\">mflow userscript</a>.</p>\n<h4>More information</h4>\n<p>You can find more information about userscripts in google chrome on the <a href=\"https://www.chromium.org/developers/design-documents/user-scripts\">chromium userscripts page</a>.</p>","frontmatter":{"title":"Hacking Around With Userscripts","date":"January 02, 2011"}}},"pageContext":{"slug":"/hacking-around-with-userscripts/","previous":{"fields":{"slug":"/loading-everything-at-once-javascript-html-css/"},"frontmatter":{"title":"Loading Everything at Once - HTML, CSS & JavaScript"}},"next":{"fields":{"slug":"/github-pages-free-html-css-javascript-hosting/"},"frontmatter":{"title":"Github Pages - Free HTML/CSS/JavaScript Hosting"}}}}