{"data":{"site":{"siteMetadata":{"title":"Christian Vuerings","author":"Christian Vuerings"}},"markdownRemark":{"id":"da4100c2-9cfb-52bc-b9da-18b14a95650f","excerpt":"Have you ever dreamed about a PC that you don’t need to shut down. Where you just had to close the lid and when you open it, it only takes about 2 seconds to be…","html":"<p>Have you ever dreamed about a PC that you don’t need to shut down. Where you just had to close the lid and when you open it, it only takes about 2 seconds to be ready to use?</p>\n<p>For over a year I’ve been a proud Mac owner and I won’t go back to Windows or any other OS soon.</p>\n<p>Currently I run Windows XP, Ubuntu and Fedora next to the native Mac OS X snow leopard operating system. All of this is made possible through the use of virtual machines. It also means that I can run them all at the same time.</p>\n<h3>Appreciate a Mac</h3>\n<p>In a nutshell, some of the things you could appreciate when using a Mac:</p>\n<ul>\n<li>No shutdown needed (except when installing major updates).</li>\n<li>Rotating pictures is so easy (and fun). You open them all in them in the Preview application and turn them with a rotate gesture.</li>\n<li>Multiple operating systems on one machine.</li>\n</ul>\n<h3>Where Apple could improve</h3>\n<p>Although Apple tries really hard to make things as easy for the user as they could, but being perfect isn’t really possible. Here’s a list of things which where hard to do or could be improved:</p>\n<ul>\n<li>Change the default program for a certain extension. If you want to do this for all the files of a specific type, it can be <a href=\"http://www.ehow.com/how_4493225_change-programs-mac-os-leopard.html\">cumbersome</a>.</li>\n<li>Change the default browser. In or to do this, you need to go <a href=\"http://www.tech-recipes.com/rx/722/mac-os-x-change-the-default-web-browser/\">through safari</a>, which seems a bit weird to me.</li>\n<li>Add more multi touch gestures to iTunes. For instance when you want to go to the first/last songs in the list - a 3 finger up or down sweep.</li>\n</ul>","frontmatter":{"title":"Once You Go Mac","date":"February 27, 2011"}}},"pageContext":{"slug":"/once-you-go-mac/","previous":{"fields":{"slug":"/weathery-a-weather-aggregator/"},"frontmatter":{"title":"Weathery – A Weather Aggregator"}},"next":{"fields":{"slug":"/thanks-zach-for-the-github-love/"},"frontmatter":{"title":"Thanks Zach for the GitHub Love"}}}}