{"data":{"site":{"siteMetadata":{"title":"Christian Vuerings","author":"Christian Vuerings"}},"markdownRemark":{"id":"8b06ca08-238a-5469-88b7-076a3f789471","excerpt":"As some of you may know, over the last couple of months I’ve been working & managing a project called  jQuery Lifestream .\nIt isn’t always that easy and there…","html":"<p>As some of you may know, over the last couple of months I’ve been working &#x26; managing a project called <a href=\"https://github.com/christianvuerings/jquery-lifestream\">jQuery Lifestream</a>.\nIt isn’t always that easy and there are just some of the things I’ve learned along the way.</p>\n<h3>Market your product</h3>\n<p>Most developers don’t do any marketing at all.\nWe worry about the fact that we spam and people won’t be interested.</p>\n<p>But if you don’t let other people know what you’re up to and show them how passionate you are, how will they ever want to join your project?</p>\n<p>Open-source is all about collaboration, which in the end allows your project to adapt and improve.\nAnd that’s what really matters in the end.</p>\n<h3>Be clear about your goals</h3>\n<p>Each project should have a set of clear goals.\nDon’t be political about it, be upfront so everyone knows where the project is heading.</p>\n<p>In some occasions people will be upset, because it doesn’t align with their goals.\nDon’t worry about them and don’t spend to much time arguing.\nIf they do want to change the project, they can fork it and do their own thing.</p>\n<h3>Be generous with praise</h3>\n<p>When is the last time you said “Thank You” and really meant it?</p>\n<p>Every time somebody commits time to an open-source project and does it for free, I just want to overwhelm them with praise &#x26; gratitude.\nThey work on it because they want to, you can’t force them to do so, it has to come from themselves.</p>\n<h3>Praise publicly</h3>\n<p>Don’t only praise in private, let other people know about their efforts as well.\nIn some occasions, if you do it in public, people are more willing to make further commitments to the project.</p>","frontmatter":{"title":"Managing an Open-source Project","date":"September 23, 2011"}}},"pageContext":{"slug":"/managing-an-open-source-project/","previous":{"fields":{"slug":"/developing-jquery-plugins/"},"frontmatter":{"title":"Developing jQuery Plug-ins"}},"next":{"fields":{"slug":"/fixing-security-preferences-in-os-x-mountain-lion/"},"frontmatter":{"title":"Fixing Security Preferences in OS X Mountain Lion"}}}}